openfoam/arc_M1.6_s02_fuscoarse/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
#include "../constant/freestreamProperties"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInf;

boundaryField
{
    inlet       { type fixedValue; value uniform $kInf; }
    outlet      { type zeroGradient; }
    farfield    { type freestream; freestreamValue uniform $kInf; }
    fuselage    { type kLowReWallFunction; value uniform 1e-10; }
    stabilizers { type kLowReWallFunction; value uniform 1e-10; }
}
