openfoam/arc_M1.6_s02_fuscoarse/0/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet       { type calculated; value uniform 0; }
    outlet      { type calculated; value uniform 0; }
    farfield    { type calculated; value uniform 0; }
    fuselage    { type boundaryCorrectedNutLowReWallFunction; value uniform 0; }
    stabilizers { type boundaryCorrectedNutLowReWallFunction; value uniform 0; }
}
